{
    "intro_text": "Frontend Engineer aus Hamburg mit 5+ Jahren Erfahrung in Frontend Webentwicklung und eCommerce. Vue und Nuxt sind die Frameworks meiner Wahl. Neben meiner VollzeitstelleDiese als Frontend Engineer finde ich dennoch Zeit, um hobbymäßig zu coden. Diese Website dient als Hub, um meine Hobbyprojekten allen zu präsentieren, die Lust auf eine Zusammenarbeit haben oder einfach nur neugierig sind. Schau dir gerne meine Applikationen, Games und anderen unterhaltsamen Dinge an.",
    "triggerscore_description": "Auf diesem Film-Bewertungsportal können Benutzer alte Filme basierend darauf bewerten, wie sehr diese die Zuschauer heute triggern. Darüber hinaus habe ich ein Filmquiz entwickelt, das Filmndaten der bewerteten Filme verwendet. Ich habe die Seite selbst entworfen und umgesetzt, einschließlich Vercel Serverless Functions und einer MongoDB, um Benutzerbewertungen zu speichern und abzurufen. Filmdaten erhalte ich über die TMDB-API. Als kleinen Bonus habe ich ein Filmquiz entwickelt, das Filmdaten zu auf Triggerscore bewerteten Filmen verwendet.",
    "vue-mealplanner_description": "Diese Anwendung bietet einen Mahlzeiten- und Einkaufsplaner. Im Vue Mealplanner können Benutzer ihre eigenen Rezepte hinzufügen und eine Liste von Lebensmitteln verwalten. Zutaten können direkt aus dem Rezept zur Einkaufsliste hinzugefügt werden. Die Daten werden im localStorage gespeichert. Alternativ können sich User eine individuelle ID erstellen und ihre Listen in einer MongoDB speichern. Der Mealplanner wird auch als PWA bereitgestellt.",
    "school-fight_description": "Dieses Game bietet rundenbasierte Kämpfe mit verschiedenen Charakteren und zehn Levels, inklusive zwei Minigames und einem Bosskampf. Außerdem gibt es sechs Trophäen und drei versteckte Charaktere zum Freischalten. Das Game ist mobile friendly und aktuell spielbar auf itch.io mit bereits 1000+ Browser Plays.",
    "clicky-clicky_description": "Um die Basics von Websocket zu lernen, habe ich dieses simple Online Multiplayer Game entwickelt. Um es zu testen, treibe gerne einen zweiten Spieler auf oder öffne einfach das Game in zwei Tabs. 😉 Klicke den Button so schnell du kannst, um das Rennen zu gewinnen.",
    "retroclub_description": "Retroclub ist eine private Freizeitveranstaltung für Gaming-Enthusiasten, bei der Games zu einem bestimmten Thema gespielt werden. Die Motivation ist, gemeinsam neue und einzigartige Games zu entdecken und einfach eine großartige Zeit zu haben. Diese Bewertungsseite ist für die Teilnehmer:innen des Retroclubs gedacht, um die Spiele zu bewerten, die wir gespielt haben.",
    "back": "Zurück"
}