{
    "intro_text": "I am a Frontend Engineer based in Hamburg, Germany with 5+ years of experience in frontend web development and eCommerce. Framework of my choice is Vue/Nuxt. Besides working fulltime as an engineer, I still find some time to code for fun. This website serves as a hub for my hobby projects for everyone who is interested in working with me or just curious. Feel free to check out applications, animations, games and other stuff I built.",
    "triggerscore_description": "On this movie rating portal movies users can rate old movies based on how much these trigger viewers today. Additionally I added a filmquiz using data of the rated movies. I designed and built the page myself including Vercel Serverless Functions and a MongoDB for saving and receiving user ratings. Movie data I receive via TMDB api. Besides that I also developed a small movie quiz using data of movies rated on Triggerscore.",
    "vue-mealplanner_description": "This application offers a meal and grocery planner. In the Vue Mealplanner users can add their own receipes and manage a list of grocery items. Ingredients can be added to the grocery list right from the recipe. Data is saved in local storage. Alternatively users can create a unique ID and save their lists in a MongoDB. The mealplanner is also provied as PWA.",
    "school-fight_description": "This game offers turn based battles with different characters and ten levels, including three mini games, a boss fight and a shop system. Additionally the game includes six trophies and three hidden characters to unlock. The game is mobile friendly and currently playable on itch.io with already 1000+ browser plays.",
    "clicky-clicky_description": "To try out Websocket I created this small online multiplayer game. If you want to test it, gather a second player or simply open the game in two tabs. 😉 Click the button as fast as you can to win the race.",
    "retroclub_description": "Retroclub is a private freetime event for gaming enthusiasts, playing games of a specific theme. It is all about discovering new and unique games together and simply having a great a time. This rating page is designed for participants of Retroclub to rate games that we played.",
    "pong_description": "My first steps in Javascript I made by coding my own version of PONG. Over the years I implemented a lot of new features and refactored the code. A variety of configuration options enables to set an individual difficulty. The trophy system encourages players to experiment and replay the game. PONG provides a single- as well as a multiplayer experience.",
    "eima_description": "eima is a web application designed to bring together the entire process of collecting ideas for activities and experiences, finding interested friends, and scheduling a common date. The name 'eima' is a nod to the German word 'Eimer', which means bucket—as in the bucket where you place your plans. Besides the option to create a private bucket list, eima focuses on groups. Groups allow users to share events and find people who would like to join. A gamification approach motivates users to turn their ideas into reality. From a technical standpoint, eima's frontend is built as a Nuxt 4 application using NuxtUI and Tailwind as UI toolkits. The backend tech stack consists of Netlify Serverless Functions and MongoDB.",
    "back": "Back"
}